/*
{
    "version": 5,
    "lyric": "[00:00.00] 演唱 : 单依纯\n[00:00.52] 作曲 : Mirian Nervo/Liv Hervo/Greg\n[00:01.04] 原唱 : 蔡依林\n[00:01.57] 音乐总监 : 陈建骐\n[00:02.09] 音响总监 : 何飚\n[00:02.62] 音乐设计 : 王皓\n[00:03.14] 制作人 : 常石磊\n[00:03.66] 改编编曲 : 常石磊\n[00:04.19] 管弦乐编写 : 李超\n[00:04.71] 混音 : 林梦洋\n[00:05.24] 乐队队长/键盘 : 吴加恩\n[00:05.76] 键盘 : Euywein杨展鸿\n[00:06.28] 吉他 : 王汉威\n[00:06.81] 鼓 : Chris Trzcinski\n[00:07.33] 打击乐 : 郑瑀\n[00:07.86] 和音 : 林灵/张炜/叶俊/陈鹏飞\n[00:08.38] PGM : 杨阳\n[00:08.90] 长号 : Terence Hsieh谢燕辉\n[00:09.43] 萨克斯/长笛 : 刘晓光\n[00:09.95] 小号 : 胡丹峰\n[00:10.48] 弦乐 : 曜爆甘弦乐团\n[00:11.01]旋转旋转\n[00:11.55]旋转旋转\n[00:17.01]月光放肆在染色的窗边\n[00:20.97]转眼魔幻所有视觉\n[00:24.72]再一杯那古老神秘恒河水\n[00:28.74]我镶在额头的猫眼\n[00:31.20]揭开了庆典\n[00:33.00]为爱囚禁数千年的关节\n[00:36.72]正诉说遗忘的爱恋\n[00:40.77]听所有喜悲系在我的腰间\n[00:44.67]让那些画面再出现再回到从前\n[00:49.92]旋转旋转\n[00:50.91]旋转跳跃我闭着眼\n[00:54.69]尘嚣看不见你沉醉了没\n[00:59.01]白雪夏夜我不停歇\n[01:02.76]模糊了年岁时光的沙漏被我踩碎\n[01:10.95]故事刻画在旋转的指尖\n[01:14.91]是谁在痴痴的追随\n[01:18.78]这一夜那破旧皇宫的台阶\n[01:22.71]我忘情抖落的汗水点亮了庆典\n[01:26.97]一层层一层层就把我紧紧包围\n[01:30.90]我要让这世界忘记了睡\n[01:34.71]你的心事倒映在倒映在我的眉间\n[01:38.64]放弃的快乐都实现难过都摧毁\n[01:46.89]旋转跳跃我闭着眼\n[01:50.70]尘嚣看不见你沉醉了没\n[01:55.05]白雪夏夜我不停歇\n[01:58.71]模糊了年岁时光的沙漏被我踩碎\n[02:03.93]旋转跳跃我闭着眼\n[02:06.66]尘嚣看不见你沉醉了没\n[02:10.98]白雪夏夜我不停歇\n[02:14.73]模糊了年岁舞娘的喜悲没人看见\n[02:23.11]天怪乖旋转旋转\n[02:27.09]地怪乖旋转旋转\n[02:30.99]天怪乖旋转旋转\n[02:35.06]地怪乖旋转旋转\n[02:39.03]天怪乖旋转旋转\n[02:43.16]地怪乖旋转旋转\n[02:46.84]天怪乖旋转旋转\n[02:52.16]地怪乖\n[02:57.66]所有喜悲系在我的腰间\n[03:00.98]让那些画面再出现回到从前\n[03:43.58]旋转跳跃我闭着眼\n[03:46.69]尘嚣看不见你沉醉了没\n[03:50.76]白雪夏夜我不停歇\n[03:54.72]模糊了年岁时光的沙漏被我踩碎\n[03:59.50]旋转跳跃我闭着眼\n[04:02.47]尘嚣看不见你沉醉了没\n[04:06.90]白雪夏夜我不停歇\n[04:10.71]模糊了年岁时光的沙漏被我踩碎\n[04:15.72]旋转跳跃我闭着眼\n[04:18.75]尘嚣看不见你沉醉了没\n[04:22.92]白雪夏夜我不停歇\n[04:26.70]模糊了年岁舞娘的喜悲没人看见\n"
}*/
export interface Lyric {
  version: number
  lyric: string
}

/**
[00:00.00] 作词 : 廖莹如/吴依铮
[00:00.48] 作曲 : 李偲菘
[00:00.97] 原唱 : 孙燕姿
[00:01.46] 词SP：华纳盛世音乐版权代理（北京）有限公司
[00:01.95] 曲SP：Universal Music Publishing CHINA/北京伟思音乐文化传播有限公司
[00:02.44] 音乐总监：谷粟@牛班NEWBAND
[00:02.92] 音响总监：何飚
[00:03.41] 舞台总监：李柯
[00:03.90] 音乐监制：陈美威
[00:04.39] 音乐设计：王皓@WONDERWALL 
[00:04.88] 制作人：汤佩弦@牛班NEWBAND
[00:05.36] 改编编曲：陈牧荻
[00:05.85] 混音：林梦洋
[00:06.34] 乐队队长：倪方来@牛班NEWBAND
[00:06.83] 键盘：董音@牛班NEWBAND/洪信杰@牛班NEWBAND
[00:07.32] 吉他：倪方来@牛班NEWBAND/毕赫宸@牛班NEWBAND
[00:07.80] 贝斯：邱培荣@牛班NEWBAND
[00:08.29] 打击乐：荣辰初@牛班NEWBAND
[00:08.78] 单簧管：毕赫宸
[00:09.27] PGM：郭锦阳@牛班NEWBAND
[00:09.76] 弦乐：李琪弦乐团
[00:10.26]窦靖童：
[00:10.74]我的小时候吵闹任性的时候
[00:15.72]我的外婆总会唱歌哄我
[00:21.00]夏天的午后老老的歌安慰我
[00:26.34]那首歌好像这样唱的
[00:32.34]天黑黑欲落雨天黑黑黑黑
[00:49.26]莫文蔚：
[00:49.77]离开小时候有了自己的生活
[00:55.02]新鲜的歌新鲜的念头
[01:00.24]任性和冲动无法控制的时候
[01:05.37]我忘记还有这样的歌
[01:11.31]天黑黑欲落雨天黑黑黑黑
[01:28.65]窦靖童：
[01:29.22]我爱上让我奋不顾身的一个人
[01:34.80]我以为这就是我所追求的世界
[01:39.99]然而横冲直撞被误解被骗
[01:44.82]是否成人的世界背后总有残缺
[01:49.92]莫文蔚：
[01:50.40]我走在每天必须面对的分岔路
[01:55.35]我怀念过去单纯美好的小幸福
[02:00.27]爱总是让人哭让人觉得不满足
[02:05.10]天空很大却看不清楚好孤独
[02:33.72]窦靖童：
[02:34.32]我爱上让我奋不顾身的一个人
[02:39.18]莫文蔚：
[02:39.42]我以为这就是我所追求的世界
[02:43.71]窦靖童：
[02:43.98]然而横冲直撞被误解被骗
[02:48.42]莫文蔚：
[02:48.63]是否成人的世界背后总有残缺
[02:53.28]合：
[02:53.46]我走在每天必须面对的分岔路
[02:57.93]我怀念过去单纯美好的小幸福
[03:02.34]爱总是让人哭让人觉得不满足
[03:06.87]天空很大却看不清楚好孤独
[03:18.87]窦靖童：
[03:19.23]天黑的时候我又想起那首歌
[03:24.42]突然期待下起安静的雨
[03:28.77]莫文蔚：
[03:29.19]原来外婆的道理早就唱给我听
[03:33.99]下起雨也要勇敢前进
[03:38.82]窦靖童：
[03:39.06]我相信一切都会平息
[03:44.49]莫文蔚：
[03:44.85]我现在好想回家去
[03:52.74]莫文蔚：
[03:53.17]天黑黑
[03:55.26]窦靖童：
[03:55.61]欲落雨
[04:00.39]合：
[04:00.82]天黑黑黑黑
 */
export interface LyricLine {
  time: number // 单位为毫秒
  text: string // 歌词内容
}
