/*
{
  "name": "准备好就出发",
  "mainTitle": null,
  "additionalTitle": null,
  "id": 2718980895,
  "pst": 0,
  "t": 0,
  "ar": [
    {
      "id": 34862670,
      "name": "黄子弘凡",
      "tns": [],
      "alias": []
    }
  ],
  "alia": [],
  "pop": 100,
  "st": 0,
  "rt": "",
  "fee": 8,
  "v": 38,
  "crbt": null,
  "cf": "",
  "al": {
    "id": 276206869,
    "name": "准备好就出发",
    "picUrl": "http://p1.music.126.net/RMhbEK1UjCHwf_DIGJdKpA==/109951171388214602.jpg",
    "tns": [],
    "pic_str": "109951171388214602",
    "pic": 109951171388214610
  },
  "dt": 185454,
  "h": {
    "br": 320000,
    "fid": 0,
    "size": 7420845,
    "vd": -58611
  },
  "m": {
    "br": 192000,
    "fid": 0,
    "size": 4452525,
    "vd": -56062
  },
  "l": {
    "br": 128000,
    "fid": 0,
    "size": 2968365,
    "vd": -54410
  },
  "sq": {
    "br": 1012137,
    "fid": 0,
    "size": 23466610,
    "vd": -58598
  },
  "hr": {
    "br": 1781842,
    "fid": 0,
    "size": 41309771,
    "vd": -58598
  },
  "a": null,
  "cd": "01",
  "no": 1,
  "rtUrl": null,
  "ftype": 0,
  "rtUrls": [],
  "djId": 0,
  "copyright": 0,
  "s_id": 0,
  "mark": 17716748288,
  "originCoverType": 0,
  "originSongSimpleData": null,
  "tagPicList": null,
  "resourceState": true,
  "version": 4,
  "songJumpInfo": null,
  "entertainmentTags": null,
  "awardTags": null,
  "displayTags": null,
  "single": 0,
  "noCopyrightRcmd": null,
  "alg": null,
  "displayReason": null,
  "rtype": 0,
  "rurl": null,
  "mst": 9,
  "cp": 0,
  "mv": 0,
  "publishTime": 0,
  "videoInfo": {
    "moreThanOne": false,
    "video": null
  }
} */
/** 曲目 */
export interface Track {
  id: number
  name: string
  dt: number
  // 歌手信息
  ar: {
    id: number
    name: string
    tns: string[]
    alias: string[]
  }[]
  // 专辑信息
  al: {
    id: number
    name: string
    picUrl: string
    tns: string[]
    alias: string[]
  }
  // Track Name Supplement - 曲目名称补充
  tns?: string[]
  alia: string[]
  mv: number
}

/*
{
    "version": 5,
    "lyric": "[00:00.00] 演唱 : 单依纯\n[00:00.52] 作曲 : Mirian Nervo/Liv Hervo/Greg\n[00:01.04] 原唱 : 蔡依林\n[00:01.57] 音乐总监 : 陈建骐\n[00:02.09] 音响总监 : 何飚\n[00:02.62] 音乐设计 : 王皓\n[00:03.14] 制作人 : 常石磊\n[00:03.66] 改编编曲 : 常石磊\n[00:04.19] 管弦乐编写 : 李超\n[00:04.71] 混音 : 林梦洋\n[00:05.24] 乐队队长/键盘 : 吴加恩\n[00:05.76] 键盘 : Euywein杨展鸿\n[00:06.28] 吉他 : 王汉威\n[00:06.81] 鼓 : Chris Trzcinski\n[00:07.33] 打击乐 : 郑瑀\n[00:07.86] 和音 : 林灵/张炜/叶俊/陈鹏飞\n[00:08.38] PGM : 杨阳\n[00:08.90] 长号 : Terence Hsieh谢燕辉\n[00:09.43] 萨克斯/长笛 : 刘晓光\n[00:09.95] 小号 : 胡丹峰\n[00:10.48] 弦乐 : 曜爆甘弦乐团\n[00:11.01]旋转旋转\n[00:11.55]旋转旋转\n[00:17.01]月光放肆在染色的窗边\n[00:20.97]转眼魔幻所有视觉\n[00:24.72]再一杯那古老神秘恒河水\n[00:28.74]我镶在额头的猫眼\n[00:31.20]揭开了庆典\n[00:33.00]为爱囚禁数千年的关节\n[00:36.72]正诉说遗忘的爱恋\n[00:40.77]听所有喜悲系在我的腰间\n[00:44.67]让那些画面再出现再回到从前\n[00:49.92]旋转旋转\n[00:50.91]旋转跳跃我闭着眼\n[00:54.69]尘嚣看不见你沉醉了没\n[00:59.01]白雪夏夜我不停歇\n[01:02.76]模糊了年岁时光的沙漏被我踩碎\n[01:10.95]故事刻画在旋转的指尖\n[01:14.91]是谁在痴痴的追随\n[01:18.78]这一夜那破旧皇宫的台阶\n[01:22.71]我忘情抖落的汗水点亮了庆典\n[01:26.97]一层层一层层就把我紧紧包围\n[01:30.90]我要让这世界忘记了睡\n[01:34.71]你的心事倒映在倒映在我的眉间\n[01:38.64]放弃的快乐都实现难过都摧毁\n[01:46.89]旋转跳跃我闭着眼\n[01:50.70]尘嚣看不见你沉醉了没\n[01:55.05]白雪夏夜我不停歇\n[01:58.71]模糊了年岁时光的沙漏被我踩碎\n[02:03.93]旋转跳跃我闭着眼\n[02:06.66]尘嚣看不见你沉醉了没\n[02:10.98]白雪夏夜我不停歇\n[02:14.73]模糊了年岁舞娘的喜悲没人看见\n[02:23.11]天怪乖旋转旋转\n[02:27.09]地怪乖旋转旋转\n[02:30.99]天怪乖旋转旋转\n[02:35.06]地怪乖旋转旋转\n[02:39.03]天怪乖旋转旋转\n[02:43.16]地怪乖旋转旋转\n[02:46.84]天怪乖旋转旋转\n[02:52.16]地怪乖\n[02:57.66]所有喜悲系在我的腰间\n[03:00.98]让那些画面再出现回到从前\n[03:43.58]旋转跳跃我闭着眼\n[03:46.69]尘嚣看不见你沉醉了没\n[03:50.76]白雪夏夜我不停歇\n[03:54.72]模糊了年岁时光的沙漏被我踩碎\n[03:59.50]旋转跳跃我闭着眼\n[04:02.47]尘嚣看不见你沉醉了没\n[04:06.90]白雪夏夜我不停歇\n[04:10.71]模糊了年岁时光的沙漏被我踩碎\n[04:15.72]旋转跳跃我闭着眼\n[04:18.75]尘嚣看不见你沉醉了没\n[04:22.92]白雪夏夜我不停歇\n[04:26.70]模糊了年岁舞娘的喜悲没人看见\n"
}*/
export interface Lyric {
  version: number
  lyric: string
}
